am/OpenFOAM-10/tutorials/incompressible/pimpleFoam/laminar/nonConformalChannel/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            entrainmentPressure;
        p0              $internalField;
        value           $internalField;
    }

    walls
    {
        type            fixedFluxPressure;
    }

    nonCouple
    {
        type            fixedFluxPressure;
    }
}

// ************************************************************************* //
